Tutorial/20230501221332-dir_local_vars.org
:PROPERTIES:
:ID:       3ce7e004-02ef-4b6d-9a1c-cff99fbf5c81
:END:
#+TITLE: dir-local-vars
#+SETUPFILE: /home/unseen/Documents/Notes/org/roam/org-setup.org

#+CREATED: [2023-05-01 Mon 22:13]
#+LAST_MODIFIED: [2023-05-26 Fri 23:33]
#+FILETAGS: emacs
+ [[id:95b6342a-ca5b-4f59-9f08-6cbd3aedf7a2][emacs]]
* directory-local variables
:PROPERTIES:
:ID:       520db492-efd0-48a1-abb6-fc712e5efb41
:END:

In emacs there is the concept of directory local variables. They get activated when you enter the directory.
They are useful for large projects.

Simply put a  file named ~.dir-locals.el~, or ~.dir-locals-1.el~ if the former is already taken.

[[elisp:add-dir-local-variable][M-x add-dir-local-variable]]  can also be used to create one.
They will be loaded when emacs enters the directory or any subdirectory containing that file.

[[id:e41bc583-ebfb-40f4-83db-d3355aa5408b][direnv]] is the shell based version of this, and you can use it in emacs too https://github.com/purcell/envrc.
